### 📖 Terraform Plan (infra/resources/prod) - success
<details>
<summary>Show Plan</summary>

```hcl
  # azurerm_storage_container.itn_filled_modules will be created
  + resource "azurerm_storage_container" "itn_filled_modules" {
      + container_access_type             = "private"
      + default_encryption_scope          = (known after apply)
      + encryption_scope_override_enabled = true
      + has_immutability_policy           = (known after apply)
      + has_legal_hold                    = (known after apply)
      + id                                = (known after apply)
      + metadata                          = (known after apply)
      + name                              = "filled-modules"
      + resource_manager_id               = (known after apply)
      + storage_account_name              = "iopitnsignst01"
    }

  # azurerm_storage_container.itn_signed_documents will be created
  + resource "azurerm_storage_container" "itn_signed_documents" {
      + container_access_type             = "private"
      + default_encryption_scope          = (known after apply)
      + encryption_scope_override_enabled = true
      + has_immutability_policy           = (known after apply)
      + has_legal_hold                    = (known after apply)
      + id                                = (known after apply)
      + metadata                          = (known after apply)
      + name                              = "signed-documents"
      + resource_manager_id               = (known after apply)
      + storage_account_name              = "iopitnsignst01"
    }

  # azurerm_storage_container.itn_uploaded_documents will be created
  + resource "azurerm_storage_container" "itn_uploaded_documents" {
      + container_access_type             = "private"
      + default_encryption_scope          = (known after apply)
      + encryption_scope_override_enabled = true
      + has_immutability_policy           = (known after apply)
      + has_legal_hold                    = (known after apply)
      + id                                = (known after apply)
      + metadata                          = (known after apply)
      + name                              = "uploaded-documents"
      + resource_manager_id               = (known after apply)
      + storage_account_name              = "iopitnsignst01"
    }

  # azurerm_storage_container.itn_validated_documents will be created
  + resource "azurerm_storage_container" "itn_validated_documents" {
      + container_access_type             = "private"
      + default_encryption_scope          = (known after apply)
      + encryption_scope_override_enabled = true
      + has_immutability_policy           = (known after apply)
      + has_legal_hold                    = (known after apply)
      + id                                = (known after apply)
      + metadata                          = (known after apply)
      + name                              = "validated-documents"
      + resource_manager_id               = (known after apply)
      + storage_account_name              = "iopitnsignst01"
    }

  # azurerm_storage_queue.itn_api_keys will be created
  + resource "azurerm_storage_queue" "itn_api_keys" {
      + id                   = (known after apply)
      + name                 = "api-keys"
      + resource_manager_id  = (known after apply)
      + storage_account_name = "iopitnsignst01"
    }

  # azurerm_storage_queue.itn_on_signature_request_ready will be created
  + resource "azurerm_storage_queue" "itn_on_signature_request_ready" {
      + id                   = (known after apply)
      + name                 = "on-signature-request-ready"
      + resource_manager_id  = (known after apply)
      + storage_account_name = "iopitnsignst01"
    }

  # azurerm_storage_queue.itn_on_signature_request_rejected will be created
  + resource "azurerm_storage_queue" "itn_on_signature_request_rejected" {
      + id                   = (known after apply)
      + name                 = "on-signature-request-rejected"
      + resource_manager_id  = (known after apply)
      + storage_account_name = "iopitnsignst01"
    }

  # azurerm_storage_queue.itn_on_signature_request_signed will be created
  + resource "azurerm_storage_queue" "itn_on_signature_request_signed" {
      + id                   = (known after apply)
      + name                 = "on-signature-request-signed"
      + resource_manager_id  = (known after apply)
      + storage_account_name = "iopitnsignst01"
    }

  # azurerm_storage_queue.itn_on_signature_request_wait_for_signature will be created
  + resource "azurerm_storage_queue" "itn_on_signature_request_wait_for_signature" {
      + id                   = (known after apply)
      + name                 = "on-signature-request-wait-for-signature"
      + resource_manager_id  = (known after apply)
      + storage_account_name = "iopitnsignst01"
    }

  # azurerm_storage_queue.itn_waiting_for_documents_to_fill will be created
  + resource "azurerm_storage_queue" "itn_waiting_for_documents_to_fill" {
      + id                   = (known after apply)
      + name                 = "waiting-for-documents-to-fill"
      + resource_manager_id  = (known after apply)
      + storage_account_name = "iopitnsignst01"
    }

  # azurerm_storage_queue.itn_waiting_for_qtsp will be created
  + resource "azurerm_storage_queue" "itn_waiting_for_qtsp" {
      + id                   = (known after apply)
      + name                 = "waiting-for-qtsp"
      + resource_manager_id  = (known after apply)
      + storage_account_name = "iopitnsignst01"
    }

  # azurerm_storage_queue.itn_waiting_for_signature_request_updates will be created
  + resource "azurerm_storage_queue" "itn_waiting_for_signature_request_updates" {
      + id                   = (known after apply)
      + name                 = "waiting-for-signature-request-updates"
      + resource_manager_id  = (known after apply)
      + storage_account_name = "iopitnsignst01"
    }

  # module.landing_cdn_itn.azurerm_cdn_endpoint.this will be created
  + resource "azurerm_cdn_endpoint" "this" {
      + content_types_to_compress     = (known after apply)
      + fqdn                          = (known after apply)
      + id                            = (known after apply)
      + is_http_allowed               = true
      + is_https_allowed              = true
      + location                      = "italynorth"
      + name                          = "io-p-itn-sign-landing-cdn-endpoint"
      + origin_host_header            = (known after apply)
      + origin_path                   = (known after apply)
      + probe_path                    = (known after apply)
      + profile_name                  = "io-p-itn-sign-landing-cdn-profile"
      + querystring_caching_behaviour = "BypassCaching"
      + resource_group_name           = "io-p-itn-sign-integration-rg-01"
      + tags                          = {
          + "BusinessUnit"   = "App IO"
          + "CostCenter"     = "TS000 - Tecnologia e Servizi"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Firma"
          + "Source"         = "https://github.com/pagopa/io-sign/blob/main/infra/resources/prod"
        }

      + delivery_rule {
          + name  = "EnforceHTTPS"
          + order = 1

          + request_scheme_condition {
              + match_values     = [
                  + "HTTP",
                ]
              + negate_condition = false
              + operator         = "Equal"
            }

          + url_redirect_action {
              + protocol      = "Https"
              + redirect_type = "Found"
            }
        }

      + global_delivery_rule {
          + modify_response_header_action {
              + action = "Overwrite"
              + name   = "Strict-Transport-Security"
              + value  = "max-age=31536000"
            }
          + modify_response_header_action {
              + action = "Append"
              + name   = "Content-Security-Policy"
              + value  = "script-src 'self' 'unsafe-inline'; script-src-elem 'self' 'unsafe-inline' https://cdn.matomo.cloud/pagopa.matomo.cloud/ https://pagopa.matomo.cloud/ https://recaptcha.net/ https://www.recaptcha.net/recaptcha/ https://www.gstatic.com/recaptcha/; style-src 'self' 'unsafe-inline' recaptcha.net; worker-src 'none'; font-src data: 'self'; img-src data: 'self' recaptcha.net; object-src 'none'; "
            }
        }

      + origin {
          + host_name  = (known after apply)
          + http_port  = 80
          + https_port = 443
          + name       = "primary"
        }
    }

  # module.landing_cdn_itn.azurerm_cdn_profile.this will be created
  + resource "azurerm_cdn_profile" "this" {
      + id                  = (known after apply)
      + location            = "italynorth"
      + name                = "io-p-itn-sign-landing-cdn-profile"
      + resource_group_name = "io-p-itn-sign-integration-rg-01"
      + sku                 = "Standard_Microsoft"
      + tags                = {
          + "BusinessUnit"   = "App IO"
          + "CostCenter"     = "TS000 - Tecnologia e Servizi"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Firma"
          + "Source"         = "https://github.com/pagopa/io-sign/blob/main/infra/resources/prod"
        }
    }

  # module.landing_cdn_itn.azurerm_monitor_diagnostic_setting.diagnostic_settings_cdn_profile will be created
  + resource "azurerm_monitor_diagnostic_setting" "diagnostic_settings_cdn_profile" {
      + id                             = (known after apply)
      + log_analytics_destination_type = (known after apply)
      + log_analytics_workspace_id     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.OperationalInsights/workspaces/io-p-law-common"
      + name                           = "io-p-itn-sign-landing-cdn-profile-diagnostic-settings"
      + target_resource_id             = (known after apply)

      + enabled_log {
          + category_group = "allLogs"
        }

      + metric {
          + category = "AllMetrics"
          + enabled  = true
        }
    }

  # module.landing_cdn_itn.null_resource.custom_hostname[0] will be created
  + resource "null_resource" "custom_hostname" {
      + id       = (known after apply)
      + triggers = {
          + "endpoint_name"       = "io-p-itn-sign-landing-cdn-endpoint"
          + "hostname"            = "firma.io.italia.it"
          + "name"                = "firma.io.italia.it"
          + "profile_name"        = "io-p-itn-sign-landing-cdn-profile"
          + "resource_group_name" = "io-p-itn-sign-integration-rg-01"
        }
    }

  # module.landing_cdn_itn.module.cdn_storage_account.azurerm_monitor_metric_alert.storage_account_low_availability[0] will be created
  + resource "azurerm_monitor_metric_alert" "storage_account_low_availability" {
      + auto_mitigate            = false
      + description              = "The average availability is less than 99.8%. Runbook: not needed."
      + enabled                  = true
      + frequency                = "PT5M"
      + id                       = (known after apply)
      + name                     = "[iopitnsignlandingsa] Low Availability"
      + resource_group_name      = "io-p-itn-sign-integration-rg-01"
      + scopes                   = (known after apply)
      + severity                 = 0
      + tags                     = {
          + "BusinessUnit"   = "App IO"
          + "CostCenter"     = "TS000 - Tecnologia e Servizi"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Firma"
          + "Source"         = "https://github.com/pagopa/io-sign/blob/main/infra/resources/prod"
        }
      + target_resource_location = (known after apply)
      + target_resource_type     = (known after apply)
      + window_size              = "PT5M"

      + criteria {
          + aggregation            = "Average"
          + metric_name            = "Availability"
          + metric_namespace       = "Microsoft.Storage/storageAccounts"
          + operator               = "LessThan"
          + skip_metric_validation = false
          + threshold              = 99.8
        }
    }

  # module.landing_cdn_itn.module.cdn_storage_account.azurerm_storage_account.this will be created
  + resource "azurerm_storage_account" "this" {
      + access_tier                        = "Hot"
      + account_kind                       = "StorageV2"
      + account_replication_type           = "GZRS"
      + account_tier                       = "Standard"
      + allow_nested_items_to_be_public    = true
      + cross_tenant_replication_enabled   = false
      + default_to_oauth_authentication    = false
      + dns_endpoint_type                  = "Standard"
      + enable_https_traffic_only          = true
      + id                                 = (known after apply)
      + infrastructure_encryption_enabled  = false
      + is_hns_enabled                     = false
      + large_file_share_enabled           = (known after apply)
      + local_user_enabled                 = true
      + location                           = "italynorth"
      + min_tls_version                    = "TLS1_2"
      + name                               = "iopitnsignlandingsa"
      + nfsv3_enabled                      = false
      + primary_access_key                 = (sensitive value)
      + primary_blob_connection_string     = (sensitive value)
      + primary_blob_endpoint              = (known after apply)
      + primary_blob_host                  = (known after apply)
      + primary_blob_internet_endpoint     = (known after apply)
      + primary_blob_internet_host         = (known after apply)
      + primary_blob_microsoft_endpoint    = (known after apply)
      + primary_blob_microsoft_host        = (known after apply)
      + primary_connection_string          = (sensitive value)
      + primary_dfs_endpoint               = (known after apply)
      + primary_dfs_host                   = (known after apply)
      + primary_dfs_internet_endpoint      = (known after apply)
      + primary_dfs_internet_host          = (known after apply)
      + primary_dfs_microsoft_endpoint     = (known after apply)
      + primary_dfs_microsoft_host         = (known after apply)
      + primary_file_endpoint              = (known after apply)
      + primary_file_host                  = (known after apply)
      + primary_file_internet_endpoint     = (known after apply)
      + primary_file_internet_host         = (known after apply)
      + primary_file_microsoft_endpoint    = (known after apply)
      + primary_file_microsoft_host        = (known after apply)
      + primary_location                   = (known after apply)
      + primary_queue_endpoint             = (known after apply)
      + primary_queue_host                 = (known after apply)
      + primary_queue_microsoft_endpoint   = (known after apply)
      + primary_queue_microsoft_host       = (known after apply)
      + primary_table_endpoint             = (known after apply)
      + primary_table_host                 = (known after apply)
      + primary_table_microsoft_endpoint   = (known after apply)
      + primary_table_microsoft_host       = (known after apply)
      + primary_web_endpoint               = (known after apply)
      + primary_web_host                   = (known after apply)
      + primary_web_internet_endpoint      = (known after apply)
      + primary_web_internet_host          = (known after apply)
      + primary_web_microsoft_endpoint     = (known after apply)
      + primary_web_microsoft_host         = (known after apply)
      + public_network_access_enabled      = true
      + queue_encryption_key_type          = "Service"
      + resource_group_name                = "io-p-itn-sign-integration-rg-01"
      + secondary_access_key               = (sensitive value)
      + secondary_blob_connection_string   = (sensitive value)
      + secondary_blob_endpoint            = (known after apply)
      + secondary_blob_host                = (known after apply)
      + secondary_blob_internet_endpoint   = (known after apply)
      + secondary_blob_internet_host       = (known after apply)
      + secondary_blob_microsoft_endpoint  = (known after apply)
      + secondary_blob_microsoft_host      = (known after apply)
      + secondary_connection_string        = (sensitive value)
      + secondary_dfs_endpoint             = (known after apply)
      + secondary_dfs_host                 = (known after apply)
      + secondary_dfs_internet_endpoint    = (known after apply)
      + secondary_dfs_internet_host        = (known after apply)
      + secondary_dfs_microsoft_endpoint   = (known after apply)
      + secondary_dfs_microsoft_host       = (known after apply)
      + secondary_file_endpoint            = (known after apply)
      + secondary_file_host                = (known after apply)
      + secondary_file_internet_endpoint   = (known after apply)
      + secondary_file_internet_host       = (known after apply)
      + secondary_file_microsoft_endpoint  = (known after apply)
      + secondary_file_microsoft_host      = (known after apply)
      + secondary_location                 = (known after apply)
      + secondary_queue_endpoint           = (known after apply)
      + secondary_queue_host               = (known after apply)
      + secondary_queue_microsoft_endpoint = (known after apply)
      + secondary_queue_microsoft_host     = (known after apply)
      + secondary_table_endpoint           = (known after apply)
      + secondary_table_host               = (known after apply)
      + secondary_table_microsoft_endpoint = (known after apply)
      + secondary_table_microsoft_host     = (known after apply)
      + secondary_web_endpoint             = (known after apply)
      + secondary_web_host                 = (known after apply)
      + secondary_web_internet_endpoint    = (known after apply)
      + secondary_web_internet_host        = (known after apply)
      + secondary_web_microsoft_endpoint   = (known after apply)
      + secondary_web_microsoft_host       = (known after apply)
      + sftp_enabled                       = false
      + shared_access_key_enabled          = true
      + table_encryption_key_type          = "Service"
      + tags                               = {
          + "BusinessUnit"   = "App IO"
          + "CostCenter"     = "TS000 - Tecnologia e Servizi"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Firma"
          + "Source"         = "https://github.com/pagopa/io-sign/blob/main/infra/resources/prod"
        }

      + blob_properties {
          + change_feed_enabled      = false
          + default_service_version  = (known after apply)
          + last_access_time_enabled = false
          + versioning_enabled       = true
        }

      + static_website {
          + error_404_document = "index.html"
          + index_document     = "index.html"
        }
    }

Plan: 18 to add, 0 to change, 0 to destroy.

Warning: Argument is deprecated

  with module.cosmosdb_account.azurerm_cosmosdb_account.this,
  on .terraform/modules/cosmosdb_account/cosmosdb_account/main.tf line 7, in resource "azurerm_cosmosdb_account" "this":
   7:   enable_free_tier          = var.enable_free_tier

This property has been superseded by `free_tier_enabled` and will be removed
in v4.0 of the AzureRM Provider

(and 30 more similar warnings elsewhere)

Warning: Deprecated attribute

  on .terraform/modules/cosmosdb_account/cosmosdb_account/output.tf line 54, in output "connection_strings":
  54:   value     = azurerm_cosmosdb_account.this.connection_strings

The attribute "connection_strings" is deprecated. Refer to the provider
documentation for details.

(and one more similar warning elsewhere)
```

</details>
